In [1]:
%load_ext autotime

In [2]:
import sys
sys.path.append('/scratch/pradap/python-work/magellan/')

time: 176 ms

In [3]:
import magellan as mg

DEBUG:Cloud:Log file (/u/p/r/pradap/.picloud/cloud.log) opened

time: 503 ms

In [4]:
A = mg.load_dataset('table_A')
B = mg.load_dataset('table_B')

time: 4.24 ms

In [5]:
A.head(2)

,ID,name,birth_year,hourly_wage,address,zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122

time: 153 ms

In [6]:
ob = mg.OverlapBlocker()

time: 64.5 ms

In [15]:
A.columns

Index([u'ID', u'name', u'birth_year', u'hourly_wage', u'address', u'zipcode'], dtype='object')

time: 1.88 ms

In [11]:
C = ob.block_tables(A, B, 'name', 'name', l_output_attrs=['name', 'address'], r_output_attrs=['name', 'address'])

0%  100%
[######] | ETA[sec]: 0.000

time: 38.3 ms

Total time elapsed: 0.021 sec

In [12]:
C

,_id,ltable_ID,rtable_ID,ltable_name,ltable_address,rtable_name,rtable_address
0,0,a3,b2,William Bridge,"3131 Webster St, San Francisco",Bill Bridge,"3131 Webster St, San Francisco"
0,1,a2,b3,Michael Franklin,"1652 Stockton St, San Francisco",Mike Franklin,"1652 Stockton St, San Francisco"
0,2,a5,b5,Alphonse Kemper,"1702 Post Street, San Francisco",Alfons Kemper,"170 Post St, Apt 4, San Francisco"
0,3,a2,b6,Michael Franklin,"1652 Stockton St, San Francisco",Michael Brodie,"133 Clement Street, San Francisco"

time: 46.7 ms

In [13]:
D = ob.block_candset(C, 'address', 'address')

0%  100%
[####] | ETA[sec]: 0.000

time: 10.7 ms

Total time elapsed: 0.006 sec

In [14]:
D

,_id,ltable_ID,rtable_ID,ltable_name,ltable_address,rtable_name,rtable_address
0,0,a3,b2,William Bridge,"3131 Webster St, San Francisco",Bill Bridge,"3131 Webster St, San Francisco"
0,1,a2,b3,Michael Franklin,"1652 Stockton St, San Francisco",Mike Franklin,"1652 Stockton St, San Francisco"
0,2,a5,b5,Alphonse Kemper,"1702 Post Street, San Francisco",Alfons Kemper,"170 Post St, Apt 4, San Francisco"
0,3,a2,b6,Michael Franklin,"1652 Stockton St, San Francisco",Michael Brodie,"133 Clement Street, San Francisco"

time: 11.5 ms

In [17]:
E = ob.block_tuples(A.ix[2], B.ix[1], 'name', 'name')
E

False

time: 2.59 ms

In [19]:
E = ob.block_tuples(A.ix[1], B.ix[1], 'name', 'name')
E

True

time: 2.61 ms